ERM/src/Documents/ЗагрузкаДанныхCRMAccountsExtract.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗагрузкаДанныхCRMAccountsExtract</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CRMAccountsExtractSourceData</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛистФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НовыеParentClients</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Применить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ParentClentAlias</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НовыеSalesКлиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Применить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CRMID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаименованиеКлиента</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ParentClient</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ParentClentAlias</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НовыеBillingКлиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Применить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CRMID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BillingID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.BillingID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаименованиеКлиента</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ParentClient</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ParentClentAlias</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеCRMID</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Применить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OldCRMID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NewCRMID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BillingID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.BillingID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаименованиеКлиента</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеBillingID</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Применить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CRMID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OldBillingID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.BillingID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NewOldBillingID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.BillingID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаименованиеКлиента</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеParentClients</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>CRMID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BillingID</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.BillingID</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаименованиеКлиента</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OldParentClient</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NewParentClient</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ParentClentAlias</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/InformationRegisters/ИерархияКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ИерархияКонтрагентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Lawson</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleSmith</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HOBs</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CRM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ParentClients</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/Documents/ЗагрузкаДанныхCRMAccountsExtract/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НЗ_ParentClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_ParentClients.Отбор.ТипВнешнейСистемы.Установить(Перечисления.ТипыВнешнихСистем.ParentClients);
	
	НЗ_SalesClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_SalesClients.Отбор.ТипВнешнейСистемы.Установить(Перечисления.ТипыВнешнихСистем.CRM);
	
	НЗ_BillingClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_BillingClients.Отбор.ТипВнешнейСистемы.Установить(Перечисления.ТипыВнешнихСистем.Lawson);
	
	НЗ_ИерархияКонтрагентов = РегистрыСведений.ИерархияКонтрагентов.СоздатьНаборЗаписей();
	
	// новые parent clients
	Для каждого ТекСтрокаТЧ Из НовыеParentClients Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйКонтагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтагент.Наименование = ТекСтрокаТЧ.Description;
		НовыйКонтагент.Записать();
		
		НЗ_ParentClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.Description);
		НЗ_ParentClients.Очистить();
		НоваяЗапись = НЗ_ParentClients.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ParentClients;
		НоваяЗапись.Идентификатор = ТекСтрокаТЧ.Description;
		НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		НЗ_ParentClients.Записать(Истина);
		
	КонецЦикла;
	
	// новые Sales клиенты
	ГоловныеКонтрагенты = ПолучитьГоловныхКонтрагентов(Дата, НовыеSalesКлиенты.ВыгрузитьКолонку("ParentClient"));
	
	Для каждого ТекСтрокаТЧ Из НовыеSalesКлиенты Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйКонтагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтагент.Наименование = ТекСтрокаТЧ.Description;
		НовыйКонтагент.Записать();
		
		НЗ_SalesClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.CRMID);
		НЗ_SalesClients.Очистить();
		НоваяЗапись = НЗ_SalesClients.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.CRM;
		НоваяЗапись.Идентификатор = ТекСтрокаТЧ.CRMID;
		НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		НЗ_SalesClients.Записать(Истина);
		
		НЗ_ИерархияКонтрагентов.Отбор.Контрагент.Установить(НовыйКонтагент.Ссылка);
		НЗ_ИерархияКонтрагентов.Очистить();
		НоваяЗапись = НЗ_ИерархияКонтрагентов.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Контрагент = НовыйКонтагент.Ссылка;
		ГоловнойКонтрагент = ГоловныеКонтрагенты[ТекСтрокаТЧ.ParentClient];
		Если ГоловнойКонтрагент = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find parent client by description '" + ТекСтрокаТЧ.ParentClient + "'",,,,Отказ);
		КонецЕсли;
		НоваяЗапись.ГоловнойКонтрагент = ГоловнойКонтрагент;
		НЗ_ИерархияКонтрагентов.Записать(Истина);
		
	КонецЦикла;
	
	// новые Billing клиенты
	ГоловныеКонтрагенты = ПолучитьГоловныхКонтрагентов(Дата, НовыеBillingКлиенты.ВыгрузитьКолонку("ParentClient"));
	
	Для каждого ТекСтрокаТЧ Из НовыеBillingКлиенты Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйКонтагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтагент.Наименование = ТекСтрокаТЧ.Description;
		НовыйКонтагент.Записать();
		
		НЗ_BillingClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.BillingID);
		НЗ_BillingClients.Очистить();
		НоваяЗапись = НЗ_BillingClients.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Lawson;
		НоваяЗапись.Идентификатор = ТекСтрокаТЧ.BillingID;
		НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		НЗ_BillingClients.Записать(Истина);
		
		НЗ_ИерархияКонтрагентов.Отбор.Контрагент.Установить(НовыйКонтагент.Ссылка);
		НЗ_ИерархияКонтрагентов.Очистить();
		НоваяЗапись = НЗ_ИерархияКонтрагентов.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Контрагент = НовыйКонтагент.Ссылка;
		Если ГоловнойКонтрагент = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find parent client by description '" + ТекСтрокаТЧ.ParentClient + "'",,,,Отказ);
		КонецЕсли;
		НоваяЗапись.ГоловнойКонтрагент = ГоловнойКонтрагент;
		НЗ_ИерархияКонтрагентов.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьГоловныхКонтрагентов(Период, МассивИдентификаторов)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаСинхронизацииОбъектовСВнешнимиСистемамиСрезПоследних.Идентификатор,
		|	НастройкаСинхронизацииОбъектовСВнешнимиСистемамиСрезПоследних.ОбъектПриемника
		|ИЗ
		|	РегистрСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СрезПоследних(
		|			&Период,
		|			ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.ParentClients)
		|				И Идентификатор В (&МассивИдентификаторов)) КАК НастройкаСинхронизацииОбъектовСВнешнимиСистемамиСрезПоследних";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Идентификатор, Выборка.ОбъектПриемника);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
